function setInfo(main, mainCfg){
  const preview=new Field({
    path: main,
    groupName: 'attachments',
    cName: 'flex',
    legend: 'Введение',
    info: 'Список возможностей скрипта',
    rtn: ['list'],
  });
  new List({
    path: preview.list,
    cName: 'discordText alert',
    list: [
      `АХТУНГ!!! Скрипт использует настройки, работающие вместе с базой данных IndexedDB.`,
      `Если ваш браузер не поддерживает её, то скрипт будет использовать дефолтный список настроек, который можно будет изменять вручную, добавляя изменения в сам скрипт`
    ]
  });
  new List({
    path: preview.list,
    cName: 'discordText alert',
    list: [
      `Большая просьба комментаторам всея DTF - не используйте сия скрипт для обхода цензуры DTF.`,
      `Возможно в итоге ваших действий, Шериф и ко. просто начнут банить комментарии, в которых упоминается хотя-бы один тег скрипта. Скрипт создавался не для этого.`,
      `Хотя...шайтан его знает, сомневаюсь что правилами DTF был учтён подобный момент. Но ведь могут натянуть сову на глобус, да? Ведь правда?`
    ]
  });
  new List({
    path: preview.list,
    cName: 'discordText',
    list: [
      `Полноценный (почти) markdown с выбором строчных спойлеров/<b>/<i>/<s>;`,
      `Своя собственная система "тегов", дающая добавлять в комментарии что угодно (почти)...`,
      `Смайлы, стикеры, изображения, гифки (видео), альбомы, эмбеды (Youtube);`,
      `Поиск гифок на Gfycat/Tenor;`,
      `Настройка вложений скрипта - скрытие показа определённого вида вложений, их размеров и т.п;`,
      `Если вдруг окажется, что скрипт действительно оценят, то скрипт понемногу будет обрастать новыми возможностями...хотя весьма вероятно, что он так и так будет ими обрастать, ведь мне действительно интересно его делать;`,
      `ПРИМЕЧАНИЕ - гифками скрипта являются видео...они меньше размером, их можно контролировать через азвтозапуск и т.п. Если вам нужна именно гифка, то используйте не анимированные теги (смайл/стикер/изображение), ведь гифки это и есть изображения;`
    ]
  });

  const attachments=new Field({
    path: main,
    groupName: 'attachments',
    cName: 'flex',
    legend: 'Attachments',
    info: 'Система собственных вложений комментариев, а также markdown',
    rtn: ['list']
  });
  new List({
    path: attachments.list,
    cName: 'discordText',
    list: [
      `Поддерживает всё (почти, но можно добавить) что хочется - смайлы, стикеры, изображения, гифки, альбомы, спойлеры/<b>/<i>/<s>;`,
      `Хочешь воткнуть в комментарий пять мемов, две гифки и смайл? Да пожалуйста;`
    ]
  });
  new List({
    path: attachments.list,
    cName: 'discordText info',
    list: [
      `Большинство тегов выглядит примерно так - :(type):(command):(type):`,
      `Type - тип вложения.`,
      `Command - команда тега. Группа и название смайла/гифки, содержимое альбома и т.п;`
    ]
  });

  const emojiPicker=new Field({
    path: main,
    groupName: 'attachments',
    cName: 'flex',
    legend: 'Emoji Picker',
    info: 'Подобно дискорду позволяет выбирать смайлы/стикеры',
    rtn: ['list']
  });
  new List({
    path: emojiPicker.list,
    cName: 'discordText',
    list: [
      `Смайлы разделены на два вида - обычные и анимированные;`,
      `Смайлы отсортированы по группам;`,
      `Группы смайлов можно отключать и сворачивать;`,
      `Строка поиска находит смайлы по названию`,
      `Имеет несколько режимов - смайлы/стикеры/изображения/ссылки;`
    ]
  });

  const gifPicker=new Field({
    path: main,
    groupName: 'attachments',
    cName: 'flex',
    legend: 'Gif Picker',
    info: 'Позволяет выбирать и искать гифки',
    rtn: ['list']
  });
  new List({
    path: gifPicker.list,
    cName: 'discordText',
    list: [
      `Гифки отсортированы по группам;`,
      `Группы гифок можно отключать и сворачивать;`,
      `Имеет несколько режимов - гифки/смайлы/стикеры/изображения/ссылки;`
    ]
  });

  const albumBuilder=new Field({
    path: main,
    groupName: 'attachments',
    cName: 'flex',
    legend: 'Album Builder',
    info: 'Позволяет собирать альбомы',
    rtn: ['list'],
  });
  new List({
    path: albumBuilder.list,
    cName: 'discordText',
    list: [
      `Можно собирать альбом как ссылками, так и изображениями из буфера обмена;`,
      `Изображения из буфера обмена загрузит на Imgur/ImageBB`,
      `Максимальный размер изображения из буфера обмена - 40mb;`
    ]
  });

  const album=new Field({
    path: main,
    groupName: 'attachments',
    cName: 'flex',
    legend: 'Album',
    info: 'Альбомы в комментариях',
    rtn: ['list']
  });
  new List({
    path: album.list,
    cName: 'discordText',
    list: [
      `Умеет всё, что умеет DTF Album 2.0;`,
      `Собрать альбом вручную нельзя - используйте Album Builder;`,
      `Поддерживает изображения, гифки и добавление текста к ним;`
    ]
  });

  const linkConverter=new Field({
    path: main,
    groupName: 'attachments',
    cName: 'flex',
    legend: 'Link Converter',
    info: 'Позволяет конвертировать URL ссылки на обычные вложения, в теги вложений скрипта',
    rtn: ['list']
  });
  new List({
    path: linkConverter.list,
    cName: 'discordText',
    list: [
      `Для примера, можно конвертировать ссылку на арт, и вставить её как тег скрипта - скрипт её увидит и обработает, показав арт как угодно...хоть как смайл;`,
      `Album Builder использует ту же систему конвертирования, но делает это сам автоматически при вставке ссылок;`
    ]
  });
  new List({
    path: linkConverter.list,
    cName: 'discordText alert',
    list: [
      `Может показаться, что данная система сделана для обхода цензуры DTF - это не так, серьёзно.`,
      `Дело сугубо в том, что DTF при виде ссылки в сообщении (даже её куска, без http(s)://), сразу же её обрабатывает и добавляет вложение в комментарий...без конвертирования ссылок, скрипт просто не сможет добавлять свои собственные теги вложений;`
    ]
  });

  const commentPreviewer=new Field({
    path: main,
    groupName: 'preview',
    cName: 'flex',
    legend: 'Comment Previewer',
    info: 'Позволяет посмотреть комментарий до его отправки',
    rtn: ['list']
  });
  new List({
    path: commentPreviewer.list,
    cName: 'discordText',
    list: [
      `Поддерживает все вложения скрипта, т.к использует ту же функциональность`
    ]
  });

  const emojis=new Field({
    path: main,
    groupName: 'attachments',
    cName: 'flex',
    legend: 'Смайлы',
    info: 'Всё о смайлах',
    rtn: ['list'],
  });
  new List({
    path: emojis.list,
    cName: 'discordText info',
    list: [
      `Смайлы и стикеры бывают двух видов и типов.`,
      `Виды:
      Дефолт - дефолтный смайл/стикер. Используется вместе с группой и именем смайла/стикера;
      Кастом - кастомный смайл/стикер. Используется вместе с зашифрованной URL ссылкой. Может быть каким угодно, главное чтобы ссылка на изображение была верной`,
      `Типы: обычный и анимировааный;`
    ]
  });
  new List({
    path: emojis.list,
    cName: 'discordText',
    list: [
      `Теги смайлов начинаются так - :e:(группа).(имя):e: / :e:(зашифрованная ссылка):e:`,
      `Смайл представляет из себя группу и имя, aka :e:dtf.sherif:e: / :e:᧤thumbs᎐gfycat᧱᎓InfamousOpulentIndianabat-poster᎐jpg:e:`,
      `:e: - смайл;
      :s: - стикер;
      :sg: - анимированный стикер;`
    ]
  });

  const gifs=new Field({
    path: main,
    groupName: 'attachments',
    cName: 'flex',
    legend: 'Гифки',
    info: 'Всё о гифках',
    rtn: ['list']
  });
  new List({
    path: gifs.list,
    cName: 'discordText info',
    list: [
      `Гифки бывают двух видов.`,
      `Виды:
      Дефолт - дефолтная гифка. Используется вместе с группой и именем гифки;
      Кастом - кастомная гифка. Используется вместе с зашифрованной URL ссылкой. Может быть какой угодно, главное чтобы ссылка на гифку была верной`
    ]
  });
  new List({
    path: gifs.list,
    cName: 'discordText',
    list: [
      `Теги гифок начинаются так - :g:(группа).(имя):g: / :g:(зашифрованная ссылка):g:`,
      `Гифка представляет из себя группу и имя, aka :g:dtf.sherif:g: / :g:᧤thumbs᎐gfycat᧱᎓AggravatingTimelyIguanodon-mobile᎐mp4:g:`,
      `:g: - гифка;
      :sg: - анимированный стикер/гифка стикер;`
    ]
  });

  const spoilers=new Field({
    path: main,
    groupName: 'attachments',
    cName: 'flex',
    legend: 'Спойлеры',
    info: 'Всё о спойлерах',
    rtn: ['list'],
  });
  new List({
    path: spoilers.list,
    cName: 'discordText',
    list: [
      `Может содержать в себе всё что угодно, будь это просто текст, смайл, или YT видео;`,
      `В самом начале спойлеров располагается небольшая плашка для показа того, что это спойлер, а также для показа его состояния открыт/закрыт;`,
      `Спойлер способен содержать элементы в элементах - к примеру, жирный текст, который содержит курсив, который содержит смайл. Ну вы поняли;`
    ]
  });
};
